/******************************************************************************

                  版权所有 (C), 2001-2011, 神州数码网络有限公司

 ******************************************************************************
  文 件 名   : app_config.h
  版 本 号   : 初稿
  作    者   : qing
  生成日期   : 2019年4月13日
  最近修改   :
  功能描述   : 系统配置头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2019年4月13日
    作    者   : qing
    修改内容   : 创建文件

******************************************************************************/
#ifndef _APP_CONFIG_H_
#define _APP_CONFIG_H_

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/
 typedef enum {FALSE = 0, TRUE = !FALSE} bool;

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/
 #define GUI_DisplayScan()			DisplayScan()
/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
 #include <stdio.h>
 #include <stdint.h>
 #include <string.h>
 #include "Platformconfig.h"
 #include "timeout_api.h"
 #include "app_debug.h"

 #if defined(STM32F030)
 #include "stm32f0xx.h"
 #include "stm32072b_eval.h"
 #include "stm32f0xx_conf.h"
 #include "single_pwm_led.h"
 #include "single_pwm_light.h"
 #include "func_keymsg.h"

 #elif defined(GD32E230)
 #include "gd32e230.h"
 #include "gd32e230c_eval.h"
 #include "gd32e230_libopt.h"

 #endif

#endif

