/******************************************************************************

                  版权所有 (C), 2001-2011, 神州数码网络有限公司

 ******************************************************************************
  文 件 名   : app_debug.h
  版 本 号   : 初稿
  作    者   : qing
  生成日期   : 2019年5月20日
  最近修改   :
  功能描述   : app_debug.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2019年5月20日
    作    者   : qing
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __APP_DEBUG_H__
#define __APP_DEBUG_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

extern int fputc(int ch, FILE *f);
extern uint8_t GetDebugBufferData(void);
extern uint16_t GetDebugDataLen(void);
extern void SendData2DebugBuf(uint8_t data);

#if defined(STM32F030)	
extern bool Asm_Usart_Debug_Busy(int Word);
#define IS_DEBUG_BUSY(data)		   Asm_Usart_Debug_Busy(data)
#elif defined(GD32E230)	
extern bool Gd_Usart_Debug_Busy(int Word);
#define IS_DEBUG_BUSY(data)		   Gd_Usart_Debug_Busy(data)
#endif

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __APP_DEBUG_H__ */
