#ifndef _WIFI_WIFI_COMMAND_H_
#define _WIFI_WIFI_COMMAND_H_

#ifdef __cplusplus
extern "C" {
#endif//__cplusplus

//****************************************************************************************
//				WiFi	端命令集
//****************************************************************************************

//******************************************************************
// 3 出厂开机
//******************************************************************
#define AXX_CAP_GET		0x10	//出厂开机指恢复出厂设置后的第一次开机，此时WiFi模组会发送指令给MCU获取此产品的相关定制参数并保存；此后正常开机，WiFi模组会直接使用保存的参数初始化，不再询问MCU。MCU主动发送这些回复也无效。
#define AXX_GET_SID		0x11	//用于设置设备默认SSID名称参数name长度不大于32位，以&字符结束，name不要包含特殊字符，可以包含字母，数字，下划线，中线。

//******************************************************************
// 4 正常开机/重启/恢复出厂/休眠唤醒/电池
//******************************************************************
#define AXX_BOT_DON 	0x16	//表示设备启动成功，但并没有完全启动，有些功能可能尚不支持，这个指令有时也用于检测WiFi是否死机
#define AXX_BOT_UP0 	0x17	//由于模组在收到MCU+BOT+DON时会回复AXX+BOT+DON（用于心跳检测），所以额外增加这个指令用于确认设备开机。备注，这个指令在开机音之前，此时有些进程尚未初始化完成。
#define AXX_MCU_RDY  	0x18	//表示设备已经完全启动，可以正常处理所有MCU的指令了
#define AXX_UID_UUID 	0x19	//模组固件版本的项目uuid
#define AXX_MAC_XXX  	0x1A	//当前模组的MAC地址
#define AXX_DEV_RST 	0x1B	//模块告知MCU模组即将重启
#define AXX_POW_OFF 	0x1C	//WiFi模组请求关机
#define AXX_POW_STA 	0x1D	//WiFi模组上电状态
#define AXX_FACTORY 	0x1E	//WiFi模组通过App执行恢复出厂设置

//******************************************************************
// 5  WiFi模组固件升级命令
//******************************************************************
#define AXX_BURNING		0x25	//模块告知MCU设备处于更新状态，请勿操作断电知道设备更新成功
								//升级成功或者失败后，WiFi都会重启，重启之前会发送AXX+DEV+RST给MCU。
#define AXX_BURN002		0x26	//WiFi模组固件升级成功
#define AXX_BURN003		0x27	//WiFi模组固件升级失败
#define AXX_SLI_OTA		0x28	//WiFi模组固件静默升级开始
#define AXX_SLI_DON		0x29	//WiFi模组固件静默升级结束

//******************************************************************
// 6  MCU在线升级
//******************************************************************
#define AXX_MCU_VER 	0x30	//获取MCU当前的版本号
#define AXX_MCU_UPD 	0x31	//模组需要升级MCU软件
#define AXX_MCU_RUN 	0x32	//WiFi模组发送MCU升级文件数据

//******************************************************************
// 7 网络命令
//******************************************************************
//WPS配网
#define AXX_WPS_ON		0x38	//表示WPS配网模式启动

//网络状态通知
#define AXX_STA_XXX		0x3C	//通知MCU有关模组连接路由器的状态，MCU也可以发送MCU+STA+GET来询问
#define AXX_ETH_XXX		0x3D	//以太网状态，MCU也可以发送MCU+ETH+GET来询问000 无001 有插入FFF 已经禁用
#define AXX_WWW_XXX 	0x3E	//模组发给MCU互联网测试状态，000 不能上网001 能上网
#define AXX_RA0_XXX		0x3F	//模组通知有关AP模式热点的被连接情况000  无人连接001  有新设备连接到模块002  有设备断开连接，但仍然有其他设备连接着FFF  AP已经隐藏

//******************************************************************
// 8 播放命令
//******************************************************************
//音量控制
#define AXX_VOL_GET		0x48	//获取当前音量
#define AXX_VOL_NNN 	0x49	//-	音量设置，nnn为0~100  如果音量是由模块自行控制的，则此命令为告知MCU当前音量
#define AXX_MUT_NNN 	0x4A	//001是mute，000是unmute。

//预置歌单和切换
#define AXX_KEY_RDY		0x50	//模块有对应的预置按键定义
#define AXX_KEY_NIL		0x51	//模块没有对应的预置按键定义

//播放状态通知
#define AXX_PLY_XXX		0x56	//-	播放状态000 不处于播放状态001 处于播放状态		
#define AXX_PLP_XXX		0x57	//当前循环模式,
#define AXX_CHN_XXX		0x58	//音乐声道001 左声道002 右声道000 立体声

//指定播放USB/TF卡某首歌曲
#define AXX_SEL_PLY		0x5E	//模块收到MCU发送的歌曲号数并且存在，开始播放
#define AXX_SEL_ERR 	0x5F	//模块收到MCU发送的歌曲号数但不存在

//******************************************************************
// 9  时间和定时器命令
//******************************************************************
#define AXX_SET_RTC		0x68	//AXX+SET+RTCYYYYMMDDHHMMSS&：模块设置MCU当前系统时间，YYYYMMDDHHMMSS为时间格式，UTC时间
#define AXX_SET_WEK 	0x69	//模块设置MCU 当前系统日期n表示星期几，0~6表示周日到周6
#define AXX_GET_RTC		0x6A	//-	模块请求MCU发送RTC时间
#define AXX_APP_RTC 	0x6B	//AXX+APP+RTCYYYYMMDDHHMMSS&：模块告知MCU当前系统时间，YYYYMMDDHHMMSS为时间格式，UTC时间
#define AXX_APP_WEK 	0x6C	//n表示星期几，0~6表示周日到周6
#define AXX_NXT_ALS		0x6D	//模块告知MCU下一个闹钟的时间. n表示为离当前时间的秒钟数.
#define AXX_NXT_ALM		0x6E	//设置当前闹钟时间.

//******************************************************************
// 10 多房间功能命令
//******************************************************************
#define AXX_SLV_YES		0x78	//模块通知MCU 设备变成子音箱
#define AXX_SLV_NOT		0x79	//模块通知MCU 设备退出成子音箱
#define AXX_SLV_XXX		0x7B	//返回子音箱的数量

//******************************************************************
// 11 AUX/BT/RCA/USB 模式切换命令
//******************************************************************
#define AXX_PLM_GET		0x80	//获取当前播放模式（WIFI, BT, AUX...）
#define AXX_PLM_XXX		0x81	//通过App切换模式时，模组可以发送AXX+PLM+nnn给MCU
#define AXX_USB_XXX		0x82	//模块通知MCU 000: USB拔出001: USB插入
#define AXX_MMC_XXX 	0x83	//模块通知MCU 000: 卡拔出001: 卡插入

//******************************************************************
// 12  MCU配置
//******************************************************************
#define AXX_WAN_LST 	0x8A	//返回网络中的AP列表
#define AXX_STA_INF		0x8B	//返回模组当前的网络连接信息

//******************************************************************
// 13  LCD显示屏
//******************************************************************
#define AXX_MEA_RDY 	0x90	//通知MCU可以调用MCU+MEA+GET获取当前歌曲信息了。
#define AXX_MEA_DAT 	0x91	//模块回复歌曲信息，以AXX+MEA+DAT开头，&结束，metadata 是json格式：{ "title": "hex(歌名)", "artist": "hex(演唱者)", "album": "hex(专辑)", "vendor": "hex(来源)" }

//******************************************************************
// 14. 阿里小智平台特殊命令
//******************************************************************
//阿里平台有一个规则：MCU发送配网命令进入配网后，模块会回馈发送AXX+WPS++ON，模块配网结束不管成功或失败或超时会发送AXX+WPS+END，在这两条回馈状态期间MCU需要不响应任何按键。
#define AXX_WPS_END 	0x98	//
#define AXX_LED_XXX		0x99	//模块通知MCU，订阅更新指示灯(000 表示关闭001 表示常亮002表示快闪003 表示慢闪)
#define AXX_REC_ON		0x9A	//在MCU发送MCU+REC++ON命令进入录音流程后，模块会回馈发送AXX+REC++ON
#define AXX_REC_OFF		0x9B	//模块结束录音时会发送AXX+REC+OFF
#define AXX_AIM_ON		0x9C	//在MCU发送MCU+AIM++ON命令进入群聊后，模块会回馈发送AXX+AIM++ON
#define AXX_AIM_OFF		0x9D	//模块结束群聊时会发送AXX+AIM+OFF

//******************************************************************
// 15 产测命令
//******************************************************************
#define AXX_LED_TES		0xA0	//进入产测模式，MCU可以闪烁所有的灯，并标记自己进入产测模式；直到发现模组的重启指令才清除产测模式状态

//******************************************************************
// 16 透传
//******************************************************************
//处于同一个多房间的MCU之间可以传递指令
#define AXX_M2S_NNN 	0xA5	//Slave的MCU会收到AXX+M2S+nnn
#define AXX_S2M_NNN 	0xA6	//Master的MCU会收到AXX+S2M+nnn

//App和MCU之间也可以透传数据
#define AXX_PAS_DATA	0xAB	//App发给MCU, WiFi模组收到App发过来的含有MCU+PAS+的tcp指令时，会继续接收数据直到发现 & 符号，然后修改成 AXX+PAS+data&指令给MCU

//******************************************************************
// 18 语音提示命令
//******************************************************************
#define AXX_LAU_GET		0xC0	//模块查询MCU语言，模块默认设置成英文，开机后会发送这个指令询问MCU默认开机语言，MCU回复MCU+LAU+XXX:
#define AXX_LAU_XXX		0xC1	//回复当前语言
#define AXX_PMT_XXX		0xC2	//模组播放语音提示时也会主动发送消息000 开始001 结束002 禁用003 可由MCU触发语音

//******************************************************************
// 19 I2S bypass
//******************************************************************
#define AXX_BYP_NNN 	0xC9	//回复I2S bypass 模式

//******************************************************************
// 20 语音识别命令
//******************************************************************
#define AXX_TLK_ON		0xD0	//模块开始语音识别
#define AXX_TLK_OFF		0xD1	//模块结束语音识别

//******************************************************************
// 21 EQ设置
//******************************************************************
#define AXX_PAS_EQ_TREBLE 	0xD6	//设置EQ Treble 
#define AXX_PAS_EQ_BASS 	0xD7	//设置EQ Bass
#define AXX_PAS_EQ_GET 		0xD8	//获取EQ 设置

#ifdef __cplusplus
}
#endif//__cplusplus

#endif

