/******************************************************************************

                  版权所有 (C), 2001-2011, 神州数码网络有限公司

 ******************************************************************************
  文 件 名   : port_ledpwm.h
  版 本 号   : 初稿
  作    者   : qing
  生成日期   : 2019年6月25日
  最近修改   :
  功能描述   : port_ledpwm.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2019年6月25日
    作    者   : qing
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __PORT_LEDPWM_H__
#define __PORT_LEDPWM_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
#if PWM_TIMER_EN
extern void func_led_pwm_scan(void);
extern void pwm_gui_setting(uint16_t period);
extern void pwm_rgb_setting(uint8_t rgb_colour, uint16_t period_rgb);
extern void timer_pwm_init(void);
extern void pwm_gpio_init(void);
#else
#define func_led_pwm_scan();
#define pwm_gui_setting(x);
#define pwm_rgb_setting(n, m);
#define timer_pwm_init();
#endif

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __PORT_LEDPWM_H__ */
